package shorcut.basic;


public class Shortcut {

	public static void main(String[] args) {
		// 주석처리
		// ctrl + / -> 거의 대부분의 IDE에서 쓰이는 단축키
		
		// 범위 주석
		// 두 줄이상 선택(shift)한 후 ctrl + Shift + /
		
		// 문장 다루기
			// 아래 한줄 추가
			// Shift + Enter
			
			// 한 줄 지우기
			// ctrl + D -> delete (환경에 따라서 duplicate)
			
			// 줄 이동
			// Alt + 위아래 방향키
			// 현재 커서가 위치한 한 줄을 줄 추가없이 이동시킨다.
			// 여러 줄 선택시, 여러줄을 한꺼번에 이동시킬 수 있다.
		
			// 들여쓰기
			// Tab
			// 범위 선택 후 Tab을 누르면 범위의 앞부분에 탭이 추가된다.
		
			// 내어쓰기
			// Shift + Tab
		
			// 줄 복사
			// ctrl + alt + 위아래방향키
			// 커서가 위치한 줄을 방향키 방향으로 복사한다.
			// 여러 줄 선택시, 선택한 줄 모두가 복사된다.
		
		// 코드에서 사용하는 단축키
		// import 정리
		// 필요한 클래스를 가져오거나 필요없는 임포트를 자동으로 제거할 때 쓰인다.
		// ctrl + Shift + o
		
		// 파일 형태 정리
		// ctrl + Shift + f
		// 자바 파일의 범위에 맞게 들여쓰기와 내어쓰기를 자동으로 정리해주는 기능
		
		// 클래스, 패키지 등을 추가할 때 사용하는 검색창 단축키
		// ctrl + n
		
		// 클래스, 패키지 등을 추가할 때 사용하는 드롭박스 단축키
		// alt + Shift + n
		
		// 변수와 같이 여러번 쓰이는 대상의 이름을 일괄적으로 변경
		// (rename의 r을 단축키로 쓴다.)
		// alt + Shift + r
		
		// 텍스트 에디터 단축키
		// Home
		// 한 줄 내에서 왼쪽으로 이동할 때 사용
		
		// End
		// 한 줄 내에서 오른쪽으로 이동할 때 사용
		
		// Shift + 방향키
		// 커서가 시작된 위치에서 도착한 위치까지를 범위 선택
		
		// Shift + Home
		// 현재 커서 위치에서 맨 왼쪽의 커서 위치까지 범위 선택
		// Shift + End
		
		// Shift + ctrl + 방향키
		// ctrl이 추가되면, 단어 단위로 이동한다.
		
		
		
		
		
		
		

	}

}
