package day01.basic;

public class Variable {

	public static void main(String[] args) {
//		주석
//		ctrl + / -> 한줄 주석
//		코드 실행 시 무시되는 부분
//		목적
//		코드에 대한 설명을 적어놓는 것
//		일시적으로 코드의 실행을 막아야 할 때
		
/* 범위 주석
 * ctrl + shift + /
 * 여러 줄을 주석처리하기 위해 사용하는 주석이다.
 * */
//		; 세미콜론
//		하나의 명령이 끝났음을 알리는 마침표 역할이다.
		
//		대입연산자
//		왼쪽에 있는(좌변) 저장공간(변수, 상수)에
//		오른쪽에 있는(우변) 값을 대입하는 연산자다.
		
		// int, double, String, boolean
		int var; // 선언
		var = 3; // "값을 할당했다."
//		int var;
		/* 변수 선언 시 주의사항
		 * 1. 같은 이름의 변수, 상수로 선언할 수 없다.
		 * 		단, 대소문자를 구분하므로, myName과 MyName은
		 * 다른 변수이다.
		 * 2. 변수의 선언과 동시에 값을 할당하는 걸,
		 * 초기화(initialize)라고 하는데, 
		 * 일반적인 변수는 반드시 초기화 해주어야 한다.
		 * 3. 가능하면 전체 코드 상단에 모아서 선언, 초기화 해준다.
		 * -> 선언부
		 * */		
//		ctrl, shift, alt의 일반적인 사용?
//		화면 확대 방법
//		
		
		
		

	}

}
